experiment-data/MicroShift/dp_redis_density-3/dp_redis_density/2022-10-11T11-24-44/kbench-pod-oid-0-tid-1/memtier.out
4         Threads
50        Connections per thread
600       Seconds


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets         1603.47          ---          ---        11.32215         6.07900        86.52700       201.72700       123.52 
Gets        16032.98         3.23     16029.74        11.31987         6.07900        87.03900       199.67900       624.64 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals      17636.45         3.23     16029.74        11.32008         6.07900        87.03900       199.67900       748.16 


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       0.047        0.000
SET       1.223        5.000
SET       1.551       10.000
SET       1.943       15.000
SET       2.575       20.000
SET       3.119       25.000
SET       3.663       30.000
SET       4.223       35.000
SET       4.799       40.000
SET       5.407       45.000
SET       6.079       50.000
SET       6.431       52.500
SET       6.847       55.000
SET       7.263       57.500
SET       7.743       60.000
SET       8.319       62.500
SET       8.959       65.000
SET       9.727       67.500
SET      10.559       70.000
SET      11.519       72.500
SET      12.671       75.000
SET      13.247       76.250
SET      13.951       77.500
SET      14.655       78.750
SET      15.423       80.000
SET      16.191       81.250
SET      17.023       82.500
SET      18.047       83.750
SET      19.199       85.000
SET      20.351       86.250
SET      21.631       87.500
SET      22.399       88.125
SET      23.167       88.750
SET      24.063       89.375
SET      25.087       90.000
SET      25.983       90.625
SET      27.135       91.250
SET      28.287       91.875
SET      29.567       92.500
SET      30.975       93.125
SET      32.767       93.750
SET      33.791       94.062
SET      34.815       94.375
SET      36.095       94.688
SET      37.375       95.000
SET      38.655       95.312
SET      39.935       95.625
SET      41.471       95.938
SET      43.263       96.250
SET      45.311       96.562
SET      47.615       96.875
SET      48.895       97.031
SET      50.175       97.188
SET      51.711       97.344
SET      53.503       97.500
SET      55.295       97.656
SET      57.343       97.812
SET      59.647       97.969
SET      62.207       98.125
SET      65.279       98.281
SET      69.119       98.438
SET      70.655       98.516
SET      72.703       98.594
SET      74.751       98.672
SET      76.799       98.750
SET      79.871       98.828
SET      82.943       98.906
SET      86.015       98.984
SET      89.599       99.062
SET      93.695       99.141
SET      98.303       99.219
SET     100.863       99.258
SET     102.911       99.297
SET     105.471       99.336
SET     108.543       99.375
SET     111.615       99.414
SET     114.687       99.453
SET     117.759       99.492
SET     121.343       99.531
SET     125.439       99.570
SET     129.535       99.609
SET     133.119       99.629
SET     135.167       99.648
SET     138.239       99.668
SET     140.287       99.688
SET     144.383       99.707
SET     148.479       99.727
SET     152.575       99.746
SET     156.671       99.766
SET     160.767       99.785
SET     165.887       99.805
SET     167.935       99.814
SET     171.007       99.824
SET     173.055       99.834
SET     176.127       99.844
SET     179.199       99.854
SET     183.295       99.863
SET     187.391       99.873
SET     192.511       99.883
SET     197.631       99.893
SET     202.751       99.902
SET     206.847       99.907
SET     210.943       99.912
SET     214.015       99.917
SET     216.063       99.922
SET     219.135       99.927
SET     222.207       99.932
SET     225.279       99.937
SET     230.399       99.941
SET     235.519       99.946
SET     239.615       99.951
SET     241.663       99.954
SET     244.735       99.956
SET     248.831       99.958
SET     250.879       99.961
SET     254.975       99.963
SET     258.047       99.966
SET     261.119       99.968
SET     264.191       99.971
SET     264.191       99.973
SET     270.335       99.976
SET     272.383       99.977
SET     274.431       99.978
SET     278.527       99.979
SET     284.671       99.980
SET     286.719       99.982
SET     288.767       99.983
SET     292.863       99.984
SET     296.959       99.985
SET     301.055       99.987
SET     305.151       99.988
SET     307.199       99.988
SET     309.247       99.989
SET     311.295       99.990
SET     315.391       99.990
SET     317.439       99.991
SET     319.487       99.991
SET     321.535       99.992
SET     323.583       99.993
SET     329.727       99.993
SET     333.823       99.994
SET     335.871       99.994
SET     335.871       99.995
SET     337.919       99.995
SET     342.015       99.995
SET     344.063       99.995
SET     348.159       99.996
SET     350.207       99.996
SET     354.303       99.996
SET     360.447       99.997
SET     364.543       99.997
SET     366.591       99.997
SET     366.591       99.997
SET     368.639       99.997
SET     368.639       99.998
SET     368.639       99.998
SET     370.687       99.998
SET     372.735       99.998
SET     376.831       99.998
SET     376.831       99.998
SET     382.975       99.998
SET     385.023       99.999
SET     385.023       99.999
SET     387.071       99.999
SET     391.167       99.999
SET     391.167       99.999
SET     397.311       99.999
SET     397.311       99.999
SET     403.455       99.999
SET     403.455       99.999
SET     405.503       99.999
SET     434.175       99.999
SET     434.175       99.999
SET     434.175       99.999
SET     456.703       99.999
SET     456.703       99.999
SET     456.703       99.999
SET     468.991      100.000
SET     468.991      100.000
SET     468.991      100.000
SET     471.039      100.000
SET     471.039      100.000
SET     471.039      100.000
[...]
SET     473.087      100.000
SET     473.087      100.000
SET     473.087      100.000
[...]
SET     483.327      100.000
SET     483.327      100.000
---
GET       0.039        0.000
GET       1.215        5.000
GET       1.551       10.000
GET       1.943       15.000
GET       2.575       20.000
GET       3.119       25.000
GET       3.663       30.000
GET       4.223       35.000
GET       4.799       40.000
GET       5.407       45.000
GET       6.079       50.000
GET       6.431       52.500
GET       6.815       55.000
GET       7.263       57.500
GET       7.743       60.000
GET       8.319       62.500
GET       8.959       65.000
GET       9.727       67.500
GET      10.559       70.000
GET      11.519       72.500
GET      12.607       75.000
GET      13.247       76.250
GET      13.887       77.500
GET      14.591       78.750
GET      15.359       80.000
GET      16.127       81.250
GET      17.023       82.500
GET      18.047       83.750
GET      19.071       85.000
GET      20.351       86.250
GET      21.631       87.500
GET      22.399       88.125
GET      23.167       88.750
GET      24.063       89.375
GET      24.959       90.000
GET      25.983       90.625
GET      27.135       91.250
GET      28.287       91.875
GET      29.567       92.500
GET      30.975       93.125
GET      32.767       93.750
GET      33.791       94.062
GET      34.815       94.375
GET      35.839       94.688
GET      37.119       95.000
GET      38.399       95.312
GET      39.935       95.625
GET      41.471       95.938
GET      43.263       96.250
GET      45.311       96.562
GET      47.615       96.875
GET      48.895       97.031
GET      50.431       97.188
GET      51.967       97.344
GET      53.759       97.500
GET      55.551       97.656
GET      57.599       97.812
GET      60.159       97.969
GET      62.719       98.125
GET      66.047       98.281
GET      69.631       98.438
GET      71.167       98.516
GET      73.215       98.594
GET      75.263       98.672
GET      77.823       98.750
GET      80.383       98.828
GET      83.455       98.906
GET      86.527       98.984
GET      90.111       99.062
GET      94.719       99.141
GET      98.303       99.219
GET     100.863       99.258
GET     103.423       99.297
GET     105.983       99.336
GET     108.543       99.375
GET     111.615       99.414
GET     114.687       99.453
GET     118.271       99.492
GET     121.855       99.531
GET     125.951       99.570
GET     130.047       99.609
GET     133.119       99.629
GET     135.167       99.648
GET     138.239       99.668
GET     140.287       99.688
GET     144.383       99.707
GET     147.455       99.727
GET     151.551       99.746
GET     155.647       99.766
GET     159.743       99.785
GET     164.863       99.805
GET     166.911       99.814
GET     169.983       99.824
GET     172.031       99.834
GET     174.079       99.844
GET     177.151       99.854
GET     181.247       99.863
GET     185.343       99.873
GET     190.463       99.883
GET     195.583       99.893
GET     201.727       99.902
GET     203.775       99.907
GET     206.847       99.912
GET     210.943       99.917
GET     214.015       99.922
GET     218.111       99.927
GET     221.183       99.932
GET     225.279       99.937
GET     229.375       99.941
GET     234.495       99.946
GET     238.591       99.951
GET     241.663       99.954
GET     243.711       99.956
GET     248.831       99.958
GET     251.903       99.961
GET     254.975       99.963
GET     258.047       99.966
GET     261.119       99.968
GET     264.191       99.971
GET     266.239       99.973
GET     272.383       99.976
GET     274.431       99.977
GET     276.479       99.978
GET     280.575       99.979
GET     284.671       99.980
GET     286.719       99.982
GET     290.815       99.983
GET     294.911       99.984
GET     299.007       99.985
GET     301.055       99.987
GET     305.151       99.988
GET     309.247       99.988
GET     311.295       99.989
GET     315.391       99.990
GET     317.439       99.990
GET     319.487       99.991
GET     321.535       99.991
GET     323.583       99.992
GET     327.679       99.993
GET     331.775       99.993
GET     335.871       99.994
GET     337.919       99.994
GET     339.967       99.995
GET     344.063       99.995
GET     348.159       99.995
GET     350.207       99.995
GET     352.255       99.996
GET     354.303       99.996
GET     358.399       99.996
GET     362.495       99.997
GET     366.591       99.997
GET     368.639       99.997
GET     370.687       99.997
GET     370.687       99.997
GET     372.735       99.998
GET     374.783       99.998
GET     376.831       99.998
GET     378.879       99.998
GET     382.975       99.998
GET     389.119       99.998
GET     393.215       99.998
GET     393.215       99.999
GET     395.263       99.999
GET     397.311       99.999
GET     397.311       99.999
GET     399.359       99.999
GET     399.359       99.999
GET     401.407       99.999
GET     405.503       99.999
GET     413.695       99.999
GET     432.127       99.999
GET     432.127       99.999
GET     434.175       99.999
GET     434.175       99.999
GET     434.175       99.999
GET     436.223       99.999
GET     438.271       99.999
GET     450.559      100.000
GET     456.703      100.000
GET     456.703      100.000
GET     458.751      100.000
GET     471.039      100.000
GET     471.039      100.000
GET     471.039      100.000
[...]
GET     473.087      100.000
GET     473.087      100.000
GET     473.087      100.000
[...]
GET     475.135      100.000
GET     475.135      100.000
GET     475.135      100.000
[...]
GET     477.183      100.000
GET     477.183      100.000
GET     477.183      100.000
[...]
GET     479.231      100.000
GET     479.231      100.000
GET     479.231      100.000
[...]
GET     481.279      100.000
GET     481.279      100.000
GET     481.279      100.000
[...]
GET     483.327      100.000
GET     483.327      100.000
GET     483.327      100.000
[...]
GET     487.423      100.000
GET     487.423      100.000
GET     487.423      100.000
[...]
GET     503.807      100.000
GET     503.807      100.000
---
WAIT      0.000      100.000